#pragma once
#include "BitmapManager.h"

class Sprite
{
public:
	vector<RECT>		m_rectList;
	int					m_iIndex;
	int					m_iApplyIndex;
	int					m_iFrameCount;
	bool				m_isLoop;
	RECT				m_currentRect;

	HDC					m_hOffScreenDC;
	Bitmap*				m_pBitmap;				// 원본 비트맵
	Bitmap*				m_pBitmapMask;			// 비트맵마스크
	int					m_iKey;					// 비트맵 키
	int					m_iKeyMask;				// 비트맵마스크 키

	float				m_fLifeTime;
	float				m_fSecPerRender;
	int					m_iCurrentFrame;
	float				m_fCurrentTime;

	TCHAR				m_szSpriteName[kSpriteMaxNameLength];
	POINT_F				m_vObjectRenderPos;
public:
	//--------------------------------------------------------------------------------------
	// Set function
	//--------------------------------------------------------------------------------------
	void			SetRectArray(vector<RECT> rtArray, int index, bool isLoop, float fLifeTime = 1.0f);
	//--------------------------------------------------------------------------------------
	// 시간에 따른 이미지 변환 함수
	//--------------------------------------------------------------------------------------
	void			Update();
	//--------------------------------------------------------------------------------------
	// Rect값 반환 함수
	//--------------------------------------------------------------------------------------
	RECT			GetDrawRect(int iUV);
	//--------------------------------------------------------------------------------------
	// 애니메이션 함수
	//--------------------------------------------------------------------------------------
	void			AnimationFrame(int iApplyIndex);
	//--------------------------------------------------------------------------------------
	// 스프라이트 로드 함수
	//--------------------------------------------------------------------------------------
	bool			Load(T_STR pszFileName, T_STR pszFileMaskName = NULL);
	//--------------------------------------------------------------------------------------
	// Frame
	//--------------------------------------------------------------------------------------
	bool			Frame();
	//--------------------------------------------------------------------------------------
	// Render
	//--------------------------------------------------------------------------------------
	bool			Render();
public:
	Sprite();
	~Sprite();
};

